Author: Ashkan Nikfarjam

I wanted to get the number of international schools in each city

source: https://www.teacherhorizons.com/schools?countries=Germany

In [2]:
import requests
from bs4 import BeautifulSoup

url = "https://www.teacherhorizons.com/schools?countries=Germany"
response = requests.get(url)
if response.status_code == 200:
    intSchool_soup = BeautifulSoup(response.content, 'html.parser')
else:
    print('couldnt reach', url)
with open("intschools.html","w") as file:
    file.write(intSchool_soup.prettify())

Scrapping Data isnt a sufficiant tool for this website due to design of of it so i decided to manually create this csv file

In [3]:
import pandas as pd
int_school = pd.read_csv("InternationalSchools.csv")
int_school.head()

         city                           Name of School  Rating
0      Berlin                   Platanus School Berkin      95
1  D端sseldorf       International School of D端sseldorf      95
2      Munich              Munich International School      95
3  Kolitzheim      International School of Mainfranken      95
4      Berlin  Berlin Brandenburg International School      88

Now lets combine this with school.csv data

In [22]:
copy_df = int_school.copy()
#print("value counts")
#print(copy_df.city.value_counts())
print("grouping")
grouped_df = copy_df.groupby('city').agg({'Name of School': list, 'Rating': 'mean', 'Name of School': 'count'}).reset_index()
grouped_df.rename(columns={'Name of School':'Number of international schools'},inplace=True)
grouped_df.head()

grouping

          city  Number of international schools     Rating
0     Augsburg                                1  88.000000
1  Bed Viblbel                                2  81.000000
2       Berlin                               14  77.357143
3         Bonn                                2  81.500000
4      Cologne                                2  81.000000

In [23]:
grouped_df.to_csv("intSchootranking.csv",index=False)